ResumeAPITests/Content/XMLFile1.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <SOAP-ENV:Header/>
  <SOAP-ENV:Body>
    <service xmlns="urn:/product/soh/updatePendingSohAndDoInquiry">
      <Envelope>
        <Sender>
          <id>sohacsid</id>
          <credential>3JR74GV32</credential>
        </Sender>
        <Packet>
          <payload>
            <Enrollment creationDate="2018-07-03T08:55:56-04:00">
              <Organization organizationId="94632" organizationName="553">
                <Subscriber>
                  <SubscriberType>
                    <SubscriberTypeCode>Employment</SubscriberTypeCode>
                  </SubscriberType>
                  <Person>
                    <IdentificationCode>
                      <IdValue name="SocialSecurityNumber">911433686</IdValue>
                      <IdValue name="EmployerGenerated">00919433686</IdValue>
                      <IdValue name="SourceApp">acs</IdValue>
                    </IdentificationCode>
                    <PersonName>
                      <GivenName>EMPLOYEE</GivenName>
                      <FamilyName>TEST</FamilyName>
                    </PersonName>
                    <Gender>1</Gender>
                    <DateOfBirth>1981-07-02</DateOfBirth>
                    <ContactInformation>
                      <Telephone/>
                      <PostalAddress>
                        <CountryCode>US</CountryCode>
                        <PostalCode>92065 </PostalCode>
                        <Region>CA</Region>
                        <Municipality>TEST CITY </Municipality>
                        <DeliveryAddress>
                          <AddressLine>TEST STREET </AddressLine>
                          <AddressLine> </AddressLine>
                        </DeliveryAddress>
                      </PostalAddress>
                    </ContactInformation>
                  </Person>
                  <Coverage>
                    <RateBasedCoverage>
                      <CoverageType>
                        <Product>Life Insurance</Product>
                        <ProductType>Basic</ProductType>
                        <CoveredEntity>Self</CoveredEntity>
                      </CoverageType>
                      <StartDate>2018-07-03</StartDate>
                      <CoverageLevel>
                        <RequestedCoverage>
                          <Volume currency="USD">20000</Volume>
                        </RequestedCoverage>
                        <StartDate>2018-07-03</StartDate>
                      </CoverageLevel>
                      <EOIRequired>1</EOIRequired>
                    </RateBasedCoverage>
                    <RateBasedCoverage>
                      <CoverageType>
                        <Product>Life Insurance</Product>
                        <ProductType>Supplemental</ProductType>
                        <CoveredEntity>Self</CoveredEntity>
                      </CoverageType>
                      <StartDate>2018-07-03</StartDate>
                      <CoverageLevel>
                        <RequestedCoverage>
                          <Volume currency="USD">250000</Volume>
                        </RequestedCoverage>
                        <StartDate>2018-07-03</StartDate>
                      </CoverageLevel>
                      <EOIRequired>1</EOIRequired>
                    </RateBasedCoverage>
                  </Coverage>
                  <Dependent relationshipCode="Spouse">
                    <Person>
                      <IdentificationCode>
                        <IdValue name="MutuallyDefined">0</IdValue>
                      </IdentificationCode>
                      <PersonName>
                        <GivenName>EMPLOYEE 911433686 </GivenName>
                        <FamilyName>TEST 911433686 </FamilyName>
                      </PersonName>
                      <Gender>2</Gender>
                      <DateOfBirth>1987-02-07</DateOfBirth>
                      <ContactInformation>
                        <PostalAddress>
                          <CountryCode>US</CountryCode>
                          <PostalCode>92065 </PostalCode>
                          <Region>CA</Region>
                          <Municipality>RAMONA</Municipality>
                          <DeliveryAddress>
                            <AddressLine>1118 MAGNOLIA AVE</AddressLine>
                          </DeliveryAddress>
                        </PostalAddress>
                      </ContactInformation>
                    </Person>
                    <Coverage>
                      <RateBasedCoverage>
                        <CoverageType>
                          <Product>Life Insurance</Product>
                          <ProductType>Basic</ProductType>
                          <CoveredEntity>Spouse</CoveredEntity>
                        </CoverageType>
                        <StartDate>2018-07-03</StartDate>
                        <CoverageLevel>
                          <RequestedCoverage>
                            <Volume currency="USD">20000</Volume>
                          </RequestedCoverage>
                          <StartDate>2018-07-03</StartDate>
                        </CoverageLevel>
                        <EOIRequired>1</EOIRequired>
                      </RateBasedCoverage>
                      <RateBasedCoverage>
                        <CoverageType>
                          <Product>Life Insurance</Product>
                          <ProductType>Supplemental</ProductType>
                          <CoveredEntity>Spouse</CoveredEntity>
                        </CoverageType>
                        <StartDate>2018-07-03</StartDate>
                        <CoverageLevel>
                          <RequestedCoverage>
                            <Volume currency="USD">250000</Volume>
                          </RequestedCoverage>
                          <StartDate>2018-07-03</StartDate>
                        </CoverageLevel>
                        <EOIRequired>1</EOIRequired>
                      </RateBasedCoverage>
                    </Coverage>
                  </Dependent>
                </Subscriber>
              </Organization>
            </Enrollment>
          </payload>
        </Packet>
      </Envelope>
    </service>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>